# Реализуйте класс QuadraticPolynomial, описывающий квадратный трехчлен. 
# При создании экземпляра класс должен принимать три аргумента в следующем порядке:
# a — коэффициент a квадратного трехчлена
# b — коэффициент b квадратного трехчлена
# c — коэффициент c квадратного трехчлена
# Класс QuadraticPolynomial должен иметь два метода класса:
#from_iterable() — метод, принимающий в качестве аргумента итерируемый объект из трех элементов a, b и c, 
# которые представляют коэффициенты квадратного трехчлена, и возвращающий экземпляр класса QuadraticPolynomial, созданный на основе переданных коэффициентов
# from_str() — метод, принимающий в качестве аргумента строку, которая содержит коэффициенты a, b и c квадратного трехчлена, записанные через пробел. 
# Метод должен возвращать экземпляр класса QuadraticPolynomial, созданный на основе переданных коэффициентов, предварительно преобразованных в экземпляры класса float 

class QuadraticPolynomial:
    def __init__(self, a, b, c):
        self.a = a
        self.b = b
        self.c = c

    @classmethod
    def from_iterable(cls, iterable):
        return cls(*iterable)

    @classmethod
    def from_str(cls, s):
        iterable = map(float, s.split())
        return cls.from_iterable(iterable)
